{
  "title": "Transcription Rules and Notes",
  "content": [
    "When developing a transliteration scheme from Latin to Turkic script, I aim to primarily use the 26 Latin letters and common symbols while ensuring that the transliterated combinations correspond one-to-one with Turkic characters in Unicode. Since I have just started learning Old Turkic, I have not yet fully grasped the actual spelling conventions of the script. Moving forward, I plan to include a feature that converts transliterated text into Turkic script that aligns with its traditional spelling conventions."
  ],
  "rules": "\nOLD TURKIC 10C00–10C4F\nUNICODE | TRANS | NAME |\n\nVowels\n10C00 a  OLD TURKIC LETTER ORKHON A\n10C01 a1 OLD TURKIC LETTER YENISEI A\n10C02 a' OLD TURKIC LETTER YENISEI AE\n10C03 i  OLD TURKIC LETTER ORKHON I\n10C04 i1 OLD TURKIC LETTER YENISEI I\n10C05 e  OLD TURKIC LETTER YENISEI E\n10C06 w  OLD TURKIC LETTER ORKHON O\n10C07 w'  OLD TURKIC LETTER ORKHON OE\n10C08 w1' OLD TURKIC LETTER YENISEI OE\n\nConsonants\n10C09 B  OLD TURKIC LETTER ORKHON AB\n10C0A B1 OLD TURKIC LETTER YENISEI AB\n10C0B b  OLD TURKIC LETTER ORKHON AEB\n10C0C b1 OLD TURKIC LETTER YENISEI AEB\n10C0D G  OLD TURKIC LETTER ORKHON AG\n10C0E G1 OLD TURKIC LETTER YENISEI AG\n10C0F g  OLD TURKIC LETTER ORKHON AEG\n10C10 g1 OLD TURKIC LETTER YENISEI AEG\n10C11 D  OLD TURKIC LETTER ORKHON AD\n10C12 D1 OLD TURKIC LETTER YENISEI AD\n10C13 d  OLD TURKIC LETTER ORKHON AED\n10C16 Y  OLD TURKIC LETTER ORKHON AY\n10C17 Y1 OLD TURKIC LETTER YENISEI AY\n10C18 y  OLD TURKIC LETTER ORKHON AEY\n10C19 y1 OLD TURKIC LETTER YENISEI AEY\n10C1A k  OLD TURKIC LETTER ORKHON AEK\n10C1B k1 OLD TURKIC LETTER YENISEI AEK\n10C1E L  OLD TURKIC LETTER ORKHON AL\n10C1F L1 OLD TURKIC LETTER YENISEI AL\n10C20 l  OLD TURKIC LETTER ORKHON AEL\n10C23 N  OLD TURKIC LETTER ORKHON AN\n10C24 n  OLD TURKIC LETTER ORKHON AEN\n10C25 n1 OLD TURKIC LETTER YENISEI AEN\n10C34 K  OLD TURKIC LETTER ORKHON AQ\n10C35 K1 OLD TURKIC LETTER YENISEI AQ\n10C3A R  OLD TURKIC LETTER ORKHON AR\n10C3B R1 OLD TURKIC LETTER YENISEI AR\n10C3C r  OLD TURKIC LETTER ORKHON AER\n10C3D S  OLD TURKIC LETTER ORKHON AS\n10C3E s  OLD TURKIC LETTER ORKHON AES\n10C43 T  OLD TURKIC LETTER ORKHON AT\n10C44 T1 OLD TURKIC LETTER YENISEI AT\n10C45 t  OLD TURKIC LETTER ORKHON AET\n10C46 t1 OLD TURKIC LETTER YENISEI AET\n\n10C14 z   OLD TURKIC LETTER ORKHON EZ\n10C15 z1  OLD TURKIC LETTER YENISEI EZ\n10C22 m   OLD TURKIC LETTER ORKHON EM\n10C2C ng1 OLD TURKIC LETTER YENISEI ANG\n10C2D ng  OLD TURKIC LETTER ORKHON ENG\n10C2E ng2 OLD TURKIC LETTER YENISEI AENG\n10C2F p   OLD TURKIC LETTER ORKHON EP\n10C32 ch  OLD TURKIC LETTER ORKHON EC\n10C33 ch1 OLD TURKIC LETTER YENISEI EC\n10C40 SH  OLD TURKIC LETTER YENISEI ASH\n10C41 sh  OLD TURKIC LETTER ORKHON ESH\n10C42 sh1 OLD TURKIC LETTER YENISEI ESH\n\n\n10C31 ICH OLD TURKIC LETTER ORKHON IC\n10C1C Wk OLD TURKIC LETTER ORKHON OEK\n10C1D Wk2 OLD TURKIC LETTER YENISEI OEK\n10C21 lt. OLD TURKIC LETTER ORKHON ELT\n10C26 nt. OLD TURKIC LETTER ORKHON ENT\n10C27 nt2. OLD TURKIC LETTER YENISEI ENT\n10C28 nch. OLD TURKIC LETTER ORKHON ENC\n10C29 nch2. OLD TURKIC LETTER YENISEI ENC\n10C2A ny. OLD TURKIC LETTER ORKHON ENY\n10C2B ny2. OLD TURKIC LETTER YENISEI ENY\n10C30 OP OLD TURKIC LETTER ORKHON OP\n10C36 IK OLD TURKIC LETTER ORKHON IQ\n10C37 IK2 OLD TURKIC LETTER YENISEI IQ\n10C38 OK OLD TURKIC LETTER ORKHON OQ\n10C39 OK2 OLD TURKIC LETTER YENISEI OQ\n10C3F ASH OLD TURKIC LETTER ORKHON ASH\n10C47 OT OLD TURKIC LETTER ORKHON OT\n10C48 BASH OLD TURKIC LETTER ORKHON BASH\n\nU+205A / two dot punctuation"
}

